In [1]:
from sklearn import set_config

set_config(print_changed_only=False)

In [2]:
import pandas as pd

df = pd.read_csv('https://raw.githubusercontent.com/codebasics/py/master/ML/14_naive_bayes/titanic.csv')
df.sample(n=5)

,PassengerId,Name,Pclass,Sex,Age,SibSp,Parch,Ticket,Fare,Cabin,Embarked,Survived
77,78,"Moutal, Mr. Rahamin Haim",3,male,NaN,0,0,374746,8.0500,NaN,S,0
518,519,"Angle, Mrs. William A (Florence ""Mary"" Agnes H...",2,female,36.0,1,0,226875,26.0000,NaN,S,1
134,135,"Sobey, Mr. Samuel James Hayden",2,male,25.0,0,0,C.A. 29178,13.0000,NaN,S,0
512,513,"McGough, Mr. James Robert",1,male,36.0,0,0,PC 17473,26.2875,E25,S,1
877,878,"Petroff, Mr. Nedelio",3,male,19.0,0,0,349212,7.8958,NaN,S,0

In [3]:
df.drop(columns=['PassengerId', 'Name', 'SibSp', 'Parch', 'Ticket', 'Cabin', 'Embarked'], inplace=True)
df.sample(n=5)

     Pclass     Sex   Age      Fare  Survived
91        3    male  20.0    7.8542         0
764       3    male  16.0    7.7750         0
585       1  female  18.0   79.6500         1
318       1  female  31.0  164.8667         1
560       3    male   NaN    7.7500         0

In [4]:
target = df['Survived']
inputs = df.drop(columns='Survived')

In [5]:
inputs = pd.concat([inputs, pd.get_dummies(inputs['Sex'])], axis='columns')
inputs.sample(n=5)

     Pclass     Sex   Age     Fare  female  male
456       1    male  65.0  26.5500       0     1
136       1  female  19.0  26.2833       1     0
161       2  female  40.0  15.7500       1     0
570       2    male  62.0  10.5000       0     1
665       2    male  32.0  73.5000       0     1

In [6]:
inputs.drop(columns='Sex', inplace=True)
inputs.sample(n=5)

     Pclass   Age     Fare  female  male
137       1  37.0  53.1000       0     1
424       3  18.0  20.2125       0     1
42        3   NaN   7.8958       0     1
192       3  19.0   7.8542       1     0
226       2  19.0  10.5000       0     1

In [7]:
inputs.columns[inputs.isna().any()]

Index(['Age'], dtype='object')

In [8]:
inputs['Age'] = inputs['Age'].fillna(inputs['Age'].mean())
inputs.columns[inputs.isna().any()]

Index([], dtype='object')

In [9]:
inputs.sample(n=5)

     Pclass        Age     Fare  female  male
45        3  29.699118   8.0500       0     1
516       2  34.000000  10.5000       1     0
504       1  16.000000  86.5000       1     0
669       1  29.699118  52.0000       1     0
625       1  61.000000  32.3208       0     1

In [10]:
from sklearn.model_selection import train_test_split

X_train, X_test, y_train, y_test = train_test_split(inputs, target, test_size=0.2)
len(X_train), len(X_test)

(712, 179)

In [11]:
from sklearn.naive_bayes import GaussianNB

model = GaussianNB()
model.fit(X_train, y_train)

GaussianNB(priors=None, var_smoothing=1e-09)

In [12]:
model.score(X_test, y_test)

0.770949720670391

In [13]:
from sklearn.model_selection import cross_val_score

cross_val_score(model, inputs, target)

array([0.79329609, 0.80337079, 0.78089888, 0.74719101, 0.79775281])

In [14]:
model.predict(X_test[:10])

array([1, 1, 0, 0, 0, 0, 1, 1, 1, 1], dtype=int64)

In [15]:
model.predict_proba(X_test[:10])

array([[0.03318226, 0.96681774],
       [0.01291375, 0.98708625],
       [0.98806575, 0.01193425],
       [0.99086834, 0.00913166],
       [0.99101175, 0.00898825],
       [0.97799684, 0.02200316],
       [0.06429299, 0.93570701],
       [0.02946004, 0.97053996],
       [0.06422808, 0.93577192],
       [0.05859979, 0.94140021]])